Revit 2024 API
ExtElemChangeBeamSectionRegistry.RegisterInterface Method
 Registers a IExtElemChangeBeamSection
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public static void RegisterInterface(
	IExtElemChangeBeamSection provider
)
Visual Basic
Public Shared Sub RegisterInterface ( _
	provider As IExtElemChangeBeamSection _
)
Visual C++
public:
static void RegisterInterface(
	IExtElemChangeBeamSection^ provider
)
Parameters
provider
Type: Autodesk.Revit.DB.Structure.IExtElemChangeBeamSection
 IExtElemChangeBeamSection to be registered.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The provider object is not valid.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.InvalidOperationException |  There is already registered Connections Provider.
See Also
ExtElemChangeBeamSectionRegistry Class
Autodesk.Revit.DB.Structure Namespace